Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
id-analyses_post" {
        id                  = "agir-sse4jppfz8-rt4ilc-POST-200"
      + region              = "ap-southeast-3"
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration_response.runs-id-g_variants has changed
  ~ resource "aws_api_gateway_integration_response" "runs-id-g_variants" {
        id                  = "agir-sse4jppfz8-ih2jru-GET-200"
      + region              = "ap-southeast-3"
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration_response.runs-id-g_variants_post has changed
  ~ resource "aws_api_gateway_integration_response" "runs-id-g_variants_post" {
        id                  = "agir-sse4jppfz8-ih2jru-POST-200"
      + region              = "ap-southeast-3"
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration_response.runs-id_post has changed
  ~ resource "aws_api_gateway_integration_response" "runs-id_post" {
        id                  = "agir-sse4jppfz8-fps4t7-POST-200"
      + region              = "ap-southeast-3"
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration_response.runs_post has changed
  ~ resource "aws_api_gateway_integration_response" "runs_post" {
        id                  = "agir-sse4jppfz8-6nxeg0-POST-200"
      + region              = "ap-southeast-3"
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.admin_proxy has changed
  ~ resource "aws_api_gateway_method" "admin_proxy" {
        id                   = "agm-sse4jppfz8-yrayho-ANY"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.analyses has changed
  ~ resource "aws_api_gateway_method" "analyses" {
        id                   = "agm-sse4jppfz8-ix2myj-GET"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.analyses-id has changed
  ~ resource "aws_api_gateway_method" "analyses-id" {
        id                   = "agm-sse4jppfz8-m5i90n-GET"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.analyses-id-g_variants has changed
  ~ resource "aws_api_gateway_method" "analyses-id-g_variants" {
        id                   = "agm-sse4jppfz8-q3gd41-GET"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.analyses-id-g_variants_post has changed
  ~ resource "aws_api_gateway_method" "analyses-id-g_variants_post" {
        id                   = "agm-sse4jppfz8-q3gd41-POST"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.analyses-id_post has changed
  ~ resource "aws_api_gateway_method" "analyses-id_post" {
        id                   = "agm-sse4jppfz8-m5i90n-POST"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.analyses_post has changed
  ~ resource "aws_api_gateway_method" "analyses_post" {
        id                   = "agm-sse4jppfz8-ix2myj-POST"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples has changed
  ~ resource "aws_api_gateway_method" "biosamples" {
        id                   = "agm-sse4jppfz8-yhw4hz-GET"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples-filtering_terms has changed
  ~ resource "aws_api_gateway_method" "biosamples-filtering_terms" {
        id                   = "agm-sse4jppfz8-p8fp4p-GET"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples-filtering_terms_post has changed
  ~ resource "aws_api_gateway_method" "biosamples-filtering_terms_post" {
        id                   = "agm-sse4jppfz8-p8fp4p-POST"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples-id has changed
  ~ resource "aws_api_gateway_method" "biosamples-id" {
        id                   = "agm-sse4jppfz8-cj0t4v-GET"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples-id-analyses has changed
  ~ resource "aws_api_gateway_method" "biosamples-id-analyses" {
        id                   = "agm-sse4jppfz8-5z5zup-GET"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples-id-analyses_post has changed
  ~ resource "aws_api_gateway_method" "biosamples-id-analyses_post" {
        id                   = "agm-sse4jppfz8-5z5zup-POST"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples-id-g_variants has changed
  ~ resource "aws_api_gateway_method" "biosamples-id-g_variants" {
        id                   = "agm-sse4jppfz8-5pywyj-GET"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples-id-g_variants_post has changed
  ~ resource "aws_api_gateway_method" "biosamples-id-g_variants_post" {
        id                   = "agm-sse4jppfz8-5pywyj-POST"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples-id-runs has changed
  ~ resource "aws_api_gateway_method" "biosamples-id-runs" {
        id                   = "agm-sse4jppfz8-0omln3-GET"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples-id-runs_post has changed
  ~ resource "aws_api_gateway_method" "biosamples-id-runs_post" {
        id                   = "agm-sse4jppfz8-0omln3-POST"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples-id_post has changed
  ~ resource "aws_api_gateway_method" "biosamples-id_post" {
        id                   = "agm-sse4jppfz8-cj0t4v-POST"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples_post has changed
  ~ resource "aws_api_gateway_method" "biosamples_post" {
        id                   = "agm-sse4jppfz8-yhw4hz-POST"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.configuration has changed
  ~ resource "aws_api_gateway_method" "configuration" {
        id                   = "agm-sse4jppfz8-zceely-GET"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.datasets has changed
  ~ resource "aws_api_gateway_method" "datasets" {
        id                   = "agm-sse4jppfz8-7qllhx-GET"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-filtering_terms has changed
  ~ resource "aws_api_gateway_method" "datasets-filtering_terms" {
        id                   = "agm-sse4jppfz8-gwxbpd-GET"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-filtering_terms_post has changed
  ~ resource "aws_api_gateway_method" "datasets-filtering_terms_post" {
        id                   = "agm-sse4jppfz8-gwxbpd-POST"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-id has changed
  ~ resource "aws_api_gateway_method" "datasets-id" {
        id                   = "agm-sse4jppfz8-988914-GET"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-id-biosamples has changed
  ~ resource "aws_api_gateway_method" "datasets-id-biosamples" {
        id                   = "agm-sse4jppfz8-gwc4y7-GET"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-id-biosamples_post has changed
  ~ resource "aws_api_gateway_method" "datasets-id-biosamples_post" {
        id                   = "agm-sse4jppfz8-gwc4y7-POST"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-id-filtering_terms has changed
  ~ resource "aws_api_gateway_method" "datasets-id-filtering_terms" {
        id                   = "agm-sse4jppfz8-pjr8lx-GET"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-id-filtering_terms_post has changed
  ~ resource "aws_api_gateway_method" "datasets-id-filtering_terms_post" {
        id                   = "agm-sse4jppfz8-pjr8lx-POST"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-id-g_variants has changed
  ~ resource "aws_api_gateway_method" "datasets-id-g_variants" {
        id                   = "agm-sse4jppfz8-p0v24v-GET"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-id-g_variants_post has changed
  ~ resource "aws_api_gateway_method" "datasets-id-g_variants_post" {
        id                   = "agm-sse4jppfz8-p0v24v-POST"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-id-individuals has changed
  ~ resource "aws_api_gateway_method" "datasets-id-individuals" {
        id                   = "agm-sse4jppfz8-hbsf0m-GET"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-id-individuals_post has changed
  ~ resource "aws_api_gateway_method" "datasets-id-individuals_post" {
        id                   = "agm-sse4jppfz8-hbsf0m-POST"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-id_post has changed
  ~ resource "aws_api_gateway_method" "datasets-id_post" {
        id                   = "agm-sse4jppfz8-988914-POST"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.datasets_post has changed
  ~ resource "aws_api_gateway_method" "datasets_post" {
        id                   = "agm-sse4jppfz8-7qllhx-POST"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.dportal_proxy has changed
  ~ resource "aws_api_gateway_method" "dportal_proxy" {
        id                   = "agm-sse4jppfz8-jsr0cp-ANY"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.entry_types has changed
  ~ resource "aws_api_gateway_method" "entry_types" {
        id                   = "agm-sse4jppfz8-xx70sd-GET"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.filtering_terms has changed
  ~ resource "aws_api_gateway_method" "filtering_terms" {
        id                   = "agm-sse4jppfz8-q86gdu-GET"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.g_variants has changed
  ~ resource "aws_api_gateway_method" "g_variants" {
        id                   = "agm-sse4jppfz8-xadyn3-GET"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.g_variants-id has changed
  ~ resource "aws_api_gateway_method" "g_variants-id" {
        id                   = "agm-sse4jppfz8-4k5xwj-GET"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.g_variants-id-biosamples has changed
  ~ resource "aws_api_gateway_method" "g_variants-id-biosamples" {
        id                   = "agm-sse4jppfz8-eu5xf3-GET"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.g_variants-id-biosamples_post has changed
  ~ resource "aws_api_gateway_method" "g_variants-id-biosamples_post" {
        id                   = "agm-sse4jppfz8-eu5xf3-POST"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.g_variants-id-individuals has changed
  ~ resource "aws_api_gateway_method" "g_variants-id-individuals" {
        id                   = "agm-sse4jppfz8-ngo9l8-GET"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.g_variants-id-individuals_post has changed
  ~ resource "aws_api_gateway_method" "g_variants-id-individuals_post" {
        id                   = "agm-sse4jppfz8-ngo9l8-POST"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.g_variants-id_post has changed
  ~ resource "aws_api_gateway_method" "g_variants-id_post" {
        id                   = "agm-sse4jppfz8-4k5xwj-POST"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.g_variants_post has changed
  ~ resource "aws_api_gateway_method" "g_variants_post" {
        id                   = "agm-sse4jppfz8-xadyn3-POST"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.individuals has changed
  ~ resource "aws_api_gateway_method" "individuals" {
        id                   = "agm-sse4jppfz8-tszbth-GET"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.individuals-filtering_terms has changed
  ~ resource "aws_api_gateway_method" "individuals-filtering_terms" {
        id                   = "agm-sse4jppfz8-2jwps9-GET"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.individuals-filtering_terms_post has changed
  ~ resource "aws_api_gateway_method" "individuals-filtering_terms_post" {
        id                   = "agm-sse4jppfz8-2jwps9-POST"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.individuals-id has changed
  ~ resource "aws_api_gateway_method" "individuals-id" {
        id                   = "agm-sse4jppfz8-2jfdqa-GET"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.individuals-id-biosamples has changed
  ~ resource "aws_api_gateway_method" "individuals-id-biosamples" {
        id                   = "agm-sse4jppfz8-cbna1t-GET"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.individuals-id-biosamples_post has changed
  ~ resource "aws_api_gateway_method" "individuals-id-biosamples_post" {
        id                   = "agm-sse4jppfz8-cbna1t-POST"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.individuals-id-g_variants has changed
  ~ resource "aws_api_gateway_method" "individuals-id-g_variants" {
        id                   = "agm-sse4jppfz8-3p7266-GET"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.individuals-id-g_variants_post has changed
  ~ resource "aws_api_gateway_method" "individuals-id-g_variants_post" {
        id                   = "agm-sse4jppfz8-3p7266-POST"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.individuals-id_post has changed
  ~ resource "aws_api_gateway_method" "individuals-id_post" {
        id                   = "agm-sse4jppfz8-2jfdqa-POST"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.individuals_post has changed
  ~ resource "aws_api_gateway_method" "individuals_post" {
        id                   = "agm-sse4jppfz8-tszbth-POST"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.info has changed
  ~ resource "aws_api_gateway_method" "info" {
        id                   = "agm-sse4jppfz8-sjzxnk-GET"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.map has changed
  ~ resource "aws_api_gateway_method" "map" {
        id                   = "agm-sse4jppfz8-2bkfl5-GET"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.projects has changed
  ~ resource "aws_api_gateway_method" "projects" {
        id                   = "agm-sse4jppfz8-oi9qkt-GET"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.root-get has changed
  ~ resource "aws_api_gateway_method" "root-get" {
        id                   = "agm-sse4jppfz8-d7i405w57f-GET"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.runs has changed
  ~ resource "aws_api_gateway_method" "runs" {
        id                   = "agm-sse4jppfz8-6nxeg0-GET"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.runs-filtering_terms has changed
  ~ resource "aws_api_gateway_method" "runs-filtering_terms" {
        id                   = "agm-sse4jppfz8-k5ywtx-GET"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.runs-filtering_terms_post has changed
  ~ resource "aws_api_gateway_method" "runs-filtering_terms_post" {
        id                   = "agm-sse4jppfz8-k5ywtx-POST"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.runs-id has changed
  ~ resource "aws_api_gateway_method" "runs-id" {
        id                   = "agm-sse4jppfz8-fps4t7-GET"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.runs-id-analyses has changed
  ~ resource "aws_api_gateway_method" "runs-id-analyses" {
        id                   = "agm-sse4jppfz8-rt4ilc-GET"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.runs-id-analyses_post has changed
  ~ resource "aws_api_gateway_method" "runs-id-analyses_post" {
        id                   = "agm-sse4jppfz8-rt4ilc-POST"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.runs-id-g_variants has changed
  ~ resource "aws_api_gateway_method" "runs-id-g_variants" {
        id                   = "agm-sse4jppfz8-ih2jru-GET"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.runs-id-g_variants_post has changed
  ~ resource "aws_api_gateway_method" "runs-id-g_variants_post" {
        id                   = "agm-sse4jppfz8-ih2jru-POST"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.runs-id_post has changed
  ~ resource "aws_api_gateway_method" "runs-id_post" {
        id                   = "agm-sse4jppfz8-fps4t7-POST"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.runs_post has changed
  ~ resource "aws_api_gateway_method" "runs_post" {
        id                   = "agm-sse4jppfz8-6nxeg0-POST"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.admin_proxy has changed
  ~ resource "aws_api_gateway_method_response" "admin_proxy" {
        id                  = "agmr-sse4jppfz8-yrayho-ANY-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.analyses has changed
  ~ resource "aws_api_gateway_method_response" "analyses" {
        id                  = "agmr-sse4jppfz8-ix2myj-GET-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.analyses-id has changed
  ~ resource "aws_api_gateway_method_response" "analyses-id" {
        id                  = "agmr-sse4jppfz8-m5i90n-GET-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.analyses-id-g_variants has changed
  ~ resource "aws_api_gateway_method_response" "analyses-id-g_variants" {
        id                  = "agmr-sse4jppfz8-q3gd41-GET-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.analyses-id-g_variants_post has changed
  ~ resource "aws_api_gateway_method_response" "analyses-id-g_variants_post" {
        id                  = "agmr-sse4jppfz8-q3gd41-POST-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.analyses-id_post has changed
  ~ resource "aws_api_gateway_method_response" "analyses-id_post" {
        id                  = "agmr-sse4jppfz8-m5i90n-POST-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.analyses_post has changed
  ~ resource "aws_api_gateway_method_response" "analyses_post" {
        id                  = "agmr-sse4jppfz8-ix2myj-POST-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.biosamples has changed
  ~ resource "aws_api_gateway_method_response" "biosamples" {
        id                  = "agmr-sse4jppfz8-yhw4hz-GET-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.biosamples-filtering_terms has changed
  ~ resource "aws_api_gateway_method_response" "biosamples-filtering_terms" {
        id                  = "agmr-sse4jppfz8-p8fp4p-GET-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.biosamples-filtering_terms_post has changed
  ~ resource "aws_api_gateway_method_response" "biosamples-filtering_terms_post" {
        id                  = "agmr-sse4jppfz8-p8fp4p-POST-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.biosamples-id has changed
  ~ resource "aws_api_gateway_method_response" "biosamples-id" {
        id                  = "agmr-sse4jppfz8-cj0t4v-GET-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.biosamples-id-analyses has changed
  ~ resource "aws_api_gateway_method_response" "biosamples-id-analyses" {
        id                  = "agmr-sse4jppfz8-5z5zup-GET-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.biosamples-id-analyses_post has changed
  ~ resource "aws_api_gateway_method_response" "biosamples-id-analyses_post" {
        id                  = "agmr-sse4jppfz8-5z5zup-POST-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.biosamples-id-g_variants has changed
  ~ resource "aws_api_gateway_method_response" "biosamples-id-g_variants" {
        id                  = "agmr-sse4jppfz8-5pywyj-GET-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.biosamples-id-g_variants_post has changed
  ~ resource "aws_api_gateway_method_response" "biosamples-id-g_variants_post" {
        id                  = "agmr-sse4jppfz8-5pywyj-POST-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.biosamples-id-runs has changed
  ~ resource "aws_api_gateway_method_response" "biosamples-id-runs" {
        id                  = "agmr-sse4jppfz8-0omln3-GET-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.biosamples-id-runs_post has changed
  ~ resource "aws_api_gateway_method_response" "biosamples-id-runs_post" {
        id                  = "agmr-sse4jppfz8-0omln3-POST-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.biosamples-id_post has changed
  ~ resource "aws_api_gateway_method_response" "biosamples-id_post" {
        id                  = "agmr-sse4jppfz8-cj0t4v-POST-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.biosamples_post has changed
  ~ resource "aws_api_gateway_method_response" "biosamples_post" {
        id                  = "agmr-sse4jppfz8-yhw4hz-POST-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.configuration has changed
  ~ resource "aws_api_gateway_method_response" "configuration" {
        id                  = "agmr-sse4jppfz8-zceely-GET-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets has changed
  ~ resource "aws_api_gateway_method_response" "datasets" {
        id                  = "agmr-sse4jppfz8-7qllhx-GET-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets-filtering_terms has changed
  ~ resource "aws_api_gateway_method_response" "datasets-filtering_terms" {
        id                  = "agmr-sse4jppfz8-gwxbpd-GET-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets-filtering_terms_post has changed
  ~ resource "aws_api_gateway_method_response" "datasets-filtering_terms_post" {
        id                  = "agmr-sse4jppfz8-gwxbpd-POST-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets-id has changed
  ~ resource "aws_api_gateway_method_response" "datasets-id" {
        id                  = "agmr-sse4jppfz8-988914-GET-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets-id-biosamples has changed
  ~ resource "aws_api_gateway_method_response" "datasets-id-biosamples" {
        id                  = "agmr-sse4jppfz8-gwc4y7-GET-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets-id-biosamples_post has changed
  ~ resource "aws_api_gateway_method_response" "datasets-id-biosamples_post" {
        id                  = "agmr-sse4jppfz8-gwc4y7-POST-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets-id-filtering_terms has changed
  ~ resource "aws_api_gateway_method_response" "datasets-id-filtering_terms" {
        id                  = "agmr-sse4jppfz8-pjr8lx-GET-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets-id-filtering_terms_post has changed
  ~ resource "aws_api_gateway_method_response" "datasets-id-filtering_terms_post" {
        id                  = "agmr-sse4jppfz8-pjr8lx-POST-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets-id-g_variants has changed
  ~ resource "aws_api_gateway_method_response" "datasets-id-g_variants" {
        id                  = "agmr-sse4jppfz8-p0v24v-GET-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets-id-g_variants_post has changed
  ~ resource "aws_api_gateway_method_response" "datasets-id-g_variants_post" {
        id                  = "agmr-sse4jppfz8-p0v24v-POST-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets-id-individuals has changed
  ~ resource "aws_api_gateway_method_response" "datasets-id-individuals" {
        id                  = "agmr-sse4jppfz8-hbsf0m-GET-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets-id-individuals_post has changed
  ~ resource "aws_api_gateway_method_response" "datasets-id-individuals_post" {
        id                  = "agmr-sse4jppfz8-hbsf0m-POST-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets-id_post has changed
  ~ resource "aws_api_gateway_method_response" "datasets-id_post" {
        id                  = "agmr-sse4jppfz8-988914-POST-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets_post has changed
  ~ resource "aws_api_gateway_method_response" "datasets_post" {
        id                  = "agmr-sse4jppfz8-7qllhx-POST-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.dportal_proxy has changed
  ~ resource "aws_api_gateway_method_response" "dportal_proxy" {
        id                  = "agmr-sse4jppfz8-jsr0cp-ANY-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.entry_types has changed
  ~ resource "aws_api_gateway_method_response" "entry_types" {
        id                  = "agmr-sse4jppfz8-xx70sd-GET-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.filtering_terms has changed
  ~ resource "aws_api_gateway_method_response" "filtering_terms" {
        id                  = "agmr-sse4jppfz8-q86gdu-GET-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.g_variants has changed
  ~ resource "aws_api_gateway_method_response" "g_variants" {
        id                  = "agmr-sse4jppfz8-xadyn3-GET-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.g_variants-id has changed
  ~ resource "aws_api_gateway_method_response" "g_variants-id" {
        id                  = "agmr-sse4jppfz8-4k5xwj-GET-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.g_variants-id-biosamples has changed
  ~ resource "aws_api_gateway_method_response" "g_variants-id-biosamples" {
        id                  = "agmr-sse4jppfz8-eu5xf3-GET-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.g_variants-id-biosamples_post has changed
  ~ resource "aws_api_gateway_method_response" "g_variants-id-biosamples_post" {
        id                  = "agmr-sse4jppfz8-eu5xf3-POST-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.g_variants-id-individuals has changed
  ~ resource "aws_api_gateway_method_response" "g_variants-id-individuals" {
        id                  = "agmr-sse4jppfz8-ngo9l8-GET-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.g_variants-id-individuals_post has changed
  ~ resource "aws_api_gateway_method_response" "g_variants-id-individuals_post" {
        id                  = "agmr-sse4jppfz8-ngo9l8-POST-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.g_variants-id_post has changed
  ~ resource "aws_api_gateway_method_response" "g_variants-id_post" {
        id                  = "agmr-sse4jppfz8-4k5xwj-POST-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.g_variants_post has changed
  ~ resource "aws_api_gateway_method_response" "g_variants_post" {
        id                  = "agmr-sse4jppfz8-xadyn3-POST-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.individuals has changed
  ~ resource "aws_api_gateway_method_response" "individuals" {
        id                  = "agmr-sse4jppfz8-tszbth-GET-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.individuals-filtering_terms has changed
  ~ resource "aws_api_gateway_method_response" "individuals-filtering_terms" {
        id                  = "agmr-sse4jppfz8-2jwps9-GET-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.individuals-filtering_terms_post has changed
  ~ resource "aws_api_gateway_method_response" "individuals-filtering_terms_post" {
        id                  = "agmr-sse4jppfz8-2jwps9-POST-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.individuals-id has changed
  ~ resource "aws_api_gateway_method_response" "individuals-id" {
        id                  = "agmr-sse4jppfz8-2jfdqa-GET-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.individuals-id-biosamples has changed
  ~ resource "aws_api_gateway_method_response" "individuals-id-biosamples" {
        id                  = "agmr-sse4jppfz8-cbna1t-GET-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.individuals-id-biosamples_post has changed
  ~ resource "aws_api_gateway_method_response" "individuals-id-biosamples_post" {
        id                  = "agmr-sse4jppfz8-cbna1t-POST-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.individuals-id-g_variants has changed
  ~ resource "aws_api_gateway_method_response" "individuals-id-g_variants" {
        id                  = "agmr-sse4jppfz8-3p7266-GET-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.individuals-id-g_variants_post has changed
  ~ resource "aws_api_gateway_method_response" "individuals-id-g_variants_post" {
        id                  = "agmr-sse4jppfz8-3p7266-POST-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.individuals-id_post has changed
  ~ resource "aws_api_gateway_method_response" "individuals-id_post" {
        id                  = "agmr-sse4jppfz8-2jfdqa-POST-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.individuals_post has changed
  ~ resource "aws_api_gateway_method_response" "individuals_post" {
        id                  = "agmr-sse4jppfz8-tszbth-POST-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.info has changed
  ~ resource "aws_api_gateway_method_response" "info" {
        id                  = "agmr-sse4jppfz8-sjzxnk-GET-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.map has changed
  ~ resource "aws_api_gateway_method_response" "map" {
        id                  = "agmr-sse4jppfz8-2bkfl5-GET-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.projects has changed
  ~ resource "aws_api_gateway_method_response" "projects" {
        id                  = "agmr-sse4jppfz8-oi9qkt-GET-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.root-get has changed
  ~ resource "aws_api_gateway_method_response" "root-get" {
        id                  = "agmr-sse4jppfz8-d7i405w57f-GET-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.runs has changed
  ~ resource "aws_api_gateway_method_response" "runs" {
        id                  = "agmr-sse4jppfz8-6nxeg0-GET-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.runs-filtering_terms has changed
  ~ resource "aws_api_gateway_method_response" "runs-filtering_terms" {
        id                  = "agmr-sse4jppfz8-k5ywtx-GET-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.runs-filtering_terms_post has changed
  ~ resource "aws_api_gateway_method_response" "runs-filtering_terms_post" {
        id                  = "agmr-sse4jppfz8-k5ywtx-POST-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.runs-id has changed
  ~ resource "aws_api_gateway_method_response" "runs-id" {
        id                  = "agmr-sse4jppfz8-fps4t7-GET-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.runs-id-analyses has changed
  ~ resource "aws_api_gateway_method_response" "runs-id-analyses" {
        id                  = "agmr-sse4jppfz8-rt4ilc-GET-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.runs-id-analyses_post has changed
  ~ resource "aws_api_gateway_method_response" "runs-id-analyses_post" {
        id                  = "agmr-sse4jppfz8-rt4ilc-POST-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.runs-id-g_variants has changed
  ~ resource "aws_api_gateway_method_response" "runs-id-g_variants" {
        id                  = "agmr-sse4jppfz8-ih2jru-GET-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.runs-id-g_variants_post has changed
  ~ resource "aws_api_gateway_method_response" "runs-id-g_variants_post" {
        id                  = "agmr-sse4jppfz8-ih2jru-POST-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.runs-id_post has changed
  ~ resource "aws_api_gateway_method_response" "runs-id_post" {
        id                  = "agmr-sse4jppfz8-fps4t7-POST-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method_response.runs_post has changed
  ~ resource "aws_api_gateway_method_response" "runs_post" {
        id                  = "agmr-sse4jppfz8-6nxeg0-POST-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_integration.results-get has changed
  ~ resource "aws_api_gateway_integration" "results-get" {
        id                      = "agi-49hervuih0-dkhqay-GET"
      + region                  = "ap-southeast-3"
        # (16 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_integration.results-options has changed
  ~ resource "aws_api_gateway_integration" "results-options" {
        id                      = "agi-49hervuih0-dkhqay-OPTIONS"
      + region                  = "ap-southeast-3"
        # (16 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_integration.submit-options has changed
  ~ resource "aws_api_gateway_integration" "submit-options" {
        id                      = "agi-49hervuih0-ww21x7-OPTIONS"
      + region                  = "ap-southeast-3"
        # (16 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_integration.submit-patch has changed
  ~ resource "aws_api_gateway_integration" "submit-patch" {
        id                      = "agi-49hervuih0-ww21x7-PATCH"
      + region                  = "ap-southeast-3"
        # (16 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_integration.submit-post has changed
  ~ resource "aws_api_gateway_integration" "submit-post" {
        id                      = "agi-49hervuih0-ww21x7-POST"
      + region                  = "ap-southeast-3"
        # (16 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_integration.vcfstats-options has changed
  ~ resource "aws_api_gateway_integration" "vcfstats-options" {
        id                      = "agi-49hervuih0-g3m5jp-OPTIONS"
      + region                  = "ap-southeast-3"
        # (16 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_integration.vcfstats-patch has changed
  ~ resource "aws_api_gateway_integration" "vcfstats-patch" {
        id                      = "agi-49hervuih0-g3m5jp-PATCH"
      + region                  = "ap-southeast-3"
        # (16 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_integration.vcfstats-post has changed
  ~ resource "aws_api_gateway_integration" "vcfstats-post" {
        id                      = "agi-49hervuih0-g3m5jp-POST"
      + region                  = "ap-southeast-3"
        # (16 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_integration_response.results-get has changed
  ~ resource "aws_api_gateway_integration_response" "results-get" {
        id                  = "agir-49hervuih0-dkhqay-GET-200"
      + region              = "ap-southeast-3"
        # (8 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_integration_response.results-options has changed
  ~ resource "aws_api_gateway_integration_response" "results-options" {
        id                  = "agir-49hervuih0-dkhqay-OPTIONS-200"
      + region              = "ap-southeast-3"
        # (8 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_integration_response.submit-options has changed
  ~ resource "aws_api_gateway_integration_response" "submit-options" {
        id                  = "agir-49hervuih0-ww21x7-OPTIONS-200"
      + region              = "ap-southeast-3"
        # (8 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_integration_response.submit-patch has changed
  ~ resource "aws_api_gateway_integration_response" "submit-patch" {
        id                  = "agir-49hervuih0-ww21x7-PATCH-200"
      + region              = "ap-southeast-3"
        # (8 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_integration_response.submit-post has changed
  ~ resource "aws_api_gateway_integration_response" "submit-post" {
        id                  = "agir-49hervuih0-ww21x7-POST-200"
      + region              = "ap-southeast-3"
        # (8 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_integration_response.vcfstats-options has changed
  ~ resource "aws_api_gateway_integration_response" "vcfstats-options" {
        id                  = "agir-49hervuih0-g3m5jp-OPTIONS-200"
      + region              = "ap-southeast-3"
        # (8 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_integration_response.vcfstats-patch has changed
  ~ resource "aws_api_gateway_integration_response" "vcfstats-patch" {
        id                  = "agir-49hervuih0-g3m5jp-PATCH-200"
      + region              = "ap-southeast-3"
        # (8 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_integration_response.vcfstats-post has changed
  ~ resource "aws_api_gateway_integration_response" "vcfstats-post" {
        id                  = "agir-49hervuih0-g3m5jp-POST-200"
      + region              = "ap-southeast-3"
        # (8 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_method.results-get has changed
  ~ resource "aws_api_gateway_method" "results-get" {
        id                   = "agm-49hervuih0-dkhqay-GET"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_method.results-options has changed
  ~ resource "aws_api_gateway_method" "results-options" {
        id                   = "agm-49hervuih0-dkhqay-OPTIONS"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_method.submit-options has changed
  ~ resource "aws_api_gateway_method" "submit-options" {
        id                   = "agm-49hervuih0-ww21x7-OPTIONS"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_method.submit-patch has changed
  ~ resource "aws_api_gateway_method" "submit-patch" {
        id                   = "agm-49hervuih0-ww21x7-PATCH"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_method.submit-post has changed
  ~ resource "aws_api_gateway_method" "submit-post" {
        id                   = "agm-49hervuih0-ww21x7-POST"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_method.vcfstats-options has changed
  ~ resource "aws_api_gateway_method" "vcfstats-options" {
        id                   = "agm-49hervuih0-g3m5jp-OPTIONS"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_method.vcfstats-patch has changed
  ~ resource "aws_api_gateway_method" "vcfstats-patch" {
        id                   = "agm-49hervuih0-g3m5jp-PATCH"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_method.vcfstats-post has changed
  ~ resource "aws_api_gateway_method" "vcfstats-post" {
        id                   = "agm-49hervuih0-g3m5jp-POST"
      + region               = "ap-southeast-3"
        # (11 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_method_response.results-get has changed
  ~ resource "aws_api_gateway_method_response" "results-get" {
        id                  = "agmr-49hervuih0-dkhqay-GET-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_method_response.results-options has changed
  ~ resource "aws_api_gateway_method_response" "results-options" {
        id                  = "agmr-49hervuih0-dkhqay-OPTIONS-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_method_response.submit-options has changed
  ~ resource "aws_api_gateway_method_response" "submit-options" {
        id                  = "agmr-49hervuih0-ww21x7-OPTIONS-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_method_response.submit-patch has changed
  ~ resource "aws_api_gateway_method_response" "submit-patch" {
        id                  = "agmr-49hervuih0-ww21x7-PATCH-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_method_response.submit-post has changed
  ~ resource "aws_api_gateway_method_response" "submit-post" {
        id                  = "agmr-49hervuih0-ww21x7-POST-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_method_response.vcfstats-options has changed
  ~ resource "aws_api_gateway_method_response" "vcfstats-options" {
        id                  = "agmr-49hervuih0-g3m5jp-OPTIONS-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_method_response.vcfstats-patch has changed
  ~ resource "aws_api_gateway_method_response" "vcfstats-patch" {
        id                  = "agmr-49hervuih0-g3m5jp-PATCH-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_method_response.vcfstats-post has changed
  ~ resource "aws_api_gateway_method_response" "vcfstats-post" {
        id                  = "agmr-49hervuih0-g3m5jp-POST-200"
      + region              = "ap-southeast-3"
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_image.this has been deleted
  - resource "docker_image" "this" {
        id           = "sha256:d4fa5120a595cb9185e14e1e3aa0dc63a21c5eccddcd1f1f34b84c7b84027e9d127214202110.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      - image_id     = "sha256:d4fa5120a595cb9185e14e1e3aa0dc63a21c5eccddcd1f1f34b84c7b84027e9d" -> null
      - name         = "127214202110.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers" -> null
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.svep[0].module.docker_image_pluginConsequence_lambda.docker_image.this has been deleted
  - resource "docker_image" "this" {
        id           = "sha256:859709e8522c393900ed8223175739f24e5162b3f2f9fe33135845a98ad4d73e127214202110.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers"
      - image_id     = "sha256:859709e8522c393900ed8223175739f24e5162b3f2f9fe33135845a98ad4d73e" -> null
      - name         = "127214202110.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers" -> null
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.svep[0].module.docker_image_qcFigures_lambda.docker_image.this has been deleted
  - resource "docker_image" "this" {
        id           = "sha256:ecd322a3209d050aa0cbe3b7474035ec59206e8d1a5a88e5d0bc4a5be8047f0a127214202110.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers"
      - image_id     = "sha256:ecd322a3209d050aa0cbe3b7474035ec59206e8d1a5a88e5d0bc4a5be8047f0a" -> null
      - name         = "127214202110.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers" -> null
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # aws_backup_plan.gaspi_backup_plan will be created
  + resource "aws_backup_plan" "gaspi_backup_plan" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "gaspi_backup_plan"
      + region   = "ap-southeast-3"
      + tags     = {
          + "Environment" = "uat"
          + "Owner"       = "gaspi"
        }
      + tags_all = {
          + "Environment" = "uat"
          + "Owner"       = "gaspi"
        }
      + version  = (known after apply)

      + rule {
          + completion_window            = 180
          + enable_continuous_backup     = false
          + rule_name                    = "weekly"
          + schedule                     = "cron(0 20 ? * SUN *)"
          + schedule_expression_timezone = "Etc/UTC"
          + start_window                 = 60
          + target_vault_name            = "gaspi_backup_vault"

          + lifecycle {
              + delete_after                              = 30
              + opt_in_to_archive_for_supported_resources = (known after apply)
            }
        }
      + rule {
          + completion_window            = 180
          + enable_continuous_backup     = false
          + rule_name                    = "yearly"
          + schedule                     = "cron(0 22 1 1 ? *)"
          + schedule_expression_timezone = "Etc/UTC"
          + start_window                 = 60
          + target_vault_name            = "gaspi_backup_vault"

          + lifecycle {
              + delete_after                              = 3650
              + opt_in_to_archive_for_supported_resources = (known after apply)
            }
        }
      + rule {
          + completion_window            = 180
          + enable_continuous_backup     = false
          + rule_name                    = "monthly"
          + schedule                     = "cron(0 21 1 * ? *)"
          + schedule_expression_timezone = "Etc/UTC"
          + start_window                 = 60
          + target_vault_name            = "gaspi_backup_vault"

          + lifecycle {
              + delete_after                              = 365
              + opt_in_to_archive_for_supported_resources = (known after apply)
            }
        }
      + rule {
          + completion_window            = 180
          + enable_continuous_backup     = false
          + rule_name                    = "daily"
          + schedule                     = "cron(0 19 * * ? *)"
          + schedule_expression_timezone = "Etc/UTC"
          + start_window                 = 60
          + target_vault_name            = "gaspi_backup_vault"

          + lifecycle {
              + delete_after                              = 7
              + opt_in_to_archive_for_supported_resources = (known after apply)
            }
        }
    }

  # aws_backup_selection.gaspi_backup_selection will be created
  + resource "aws_backup_selection" "gaspi_backup_selection" {
      + iam_role_arn  = (known after apply)
      + id            = (known after apply)
      + name          = "gaspi_backup_resource_selection"
      + not_resources = (known after apply)
      + plan_id       = (known after apply)
      + region        = "ap-southeast-3"

      + condition (known after apply)

      + selection_tag {
          + key   = "backup"
          + type  = "STRINGEQUALS"
          + value = "true"
        }
    }

  # aws_backup_vault.gaspi_backup_vault will be created
  + resource "aws_backup_vault" "gaspi_backup_vault" {
      + arn             = (known after apply)
      + force_destroy   = false
      + id              = (known after apply)
      + kms_key_arn     = (known after apply)
      + name            = "gaspi_backup_vault"
      + recovery_points = (known after apply)
      + region          = "ap-southeast-3"
      + tags            = {
          + "Environment" = "uat"
          + "Owner"       = "gaspi"
        }
      + tags_all        = {
          + "Environment" = "uat"
          + "Owner"       = "gaspi"
        }
    }

  # aws_iam_role.gaspi_backup_role will be created
  + resource "aws_iam_role" "gaspi_backup_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "backup.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "gaspi_backup_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.gaspi_backup_role_attachment will be created
  + resource "aws_iam_role_policy_attachment" "gaspi_backup_role_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSBackupServiceRolePolicyForBackup"
      + role       = "gaspi_backup_role"
    }

  # aws_iam_role_policy_attachment.gaspi_backup_s3_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "gaspi_backup_s3_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSBackupServiceRolePolicyForS3Backup"
      + role       = "gaspi_backup_role"
    }

  # aws_iam_role_policy_attachment.gaspi_restore_s3_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "gaspi_restore_s3_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSBackupServiceRolePolicyForS3Restore"
      + role       = "gaspi_backup_role"
    }

  # module.sbeacon.data.aws_iam_policy_document.admin-lambda-access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "admin-lambda-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "cognito-idp:*",
            ]
          + resources = [
              + "arn:aws:cognito-idp:ap-southeast-3:127214202110:userpool/ap-southeast-3_586AXnWYN",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:GetItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:127214202110:table/sbeacon-dataportal-users-quota",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:DeleteItem",
              + "dynamodb:GetItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:127214202110:table/sbeacon-dataportal-juptyer-notebooks",
              + "arn:aws:dynamodb:ap-southeast-3:127214202110:table/sbeacon-dataportal-users-quota",
            ]
        }
      + statement {
          + actions   = [
              + "sagemaker:DescribeNotebookInstance",
              + "sagemaker:StopNotebookInstance",
            ]
          + resources = [
              + "arn:aws:sagemaker:ap-southeast-3:127214202110:notebook-instance/*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:127214202110:function:cognito-sendRegistrationEmail",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.athena-full-access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "athena-full-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "athena:GetQueryExecution",
              + "athena:GetQueryResults",
              + "athena:StartQueryExecution",
            ]
          + resources = [
              + "arn:aws:athena:ap-southeast-3:127214202110:workgroup/query_workgroup",
            ]
        }
      + statement {
          + actions   = [
              + "glue:*",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:*",
            ]
          + resources = [
              + "arn:aws:s3:::gasi-metadata-20250524134912137300000004",
              + "arn:aws:s3:::gasi-metadata-20250524134912137300000004/*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:Query",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:127214202110:table/sbeacon-dataportal-project-users/index/uid-index",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.data-portal-lambda-access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_docu
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.